<!-- add-pr-comment:common_plan -->

# staging/common Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_kinesis_firehose_delivery_stream.newrelic_firehose_stream[0] will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "newrelic_firehose_stream" {
        id             = "arn:aws:firehose:ca-central-1:239043911459:deliverystream/newrelic_firehose_stream_staging"
        name           = "newrelic_firehose_stream_staging"
        tags           = {}
        # (6 unchanged attributes hidden)
      ~ http_endpoint_configuration {
          ~ access_key         = (sensitive value)
            name               = "New Relic staging"
            # (6 unchanged attributes hidden)
            # (4 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }
  # newrelic_api_access_key.newrelic_aws_access_key[0] will be created
  + resource "newrelic_api_access_key" "newrelic_aws_access_key" {
      + account_id  = (sensitive value)
      + id          = (known after apply)
      + ingest_type = (known after apply)
      + key         = (known after apply)
      + key_type    = "USER"
      + name        = "notify_tf_provider"
      + notes       = "Used by Notify Terraform Code to create New Relic Resources"
      + user_id     = (sensitive value)
    }
Plan: 1 to add, 1 to change, 0 to destroy.

# --- End of Plan 1 ---

```